converter/cache/wsdl.xml

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="MarketplaceAPIService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:i0="http://www.cdiscount.com" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://tempuri.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:import namespace="http://www.cdiscount.com" location="https://wsvc.cdiscount.com/MarketplaceAPIService.svc?wsdl=wsdl0"/><wsdl:types/><wsdl:binding name="BasicHttpBinding_IMarketplaceAPIService" type="i0:IMarketplaceAPIService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetProductList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetProductList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubmitProductPackage"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/SubmitProductPackage" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetProductPackageSubmissionResult"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetProductPackageSubmissionResult" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetProductPackageProductMatchingFileData"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetProductPackageProductMatchingFileData" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetAllowedCategoryTree"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetAllowedCategoryTree" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetAllAllowedCategoryTree"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetAllAllowedCategoryTree" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetModelList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetModelList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetAllModelList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetAllModelList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetBrandList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetBrandList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetProductListByIdentifier"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetProductListByIdentifier" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubmitOfferPackage"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/SubmitOfferPackage" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetOfferPackageSubmissionResult"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetOfferPackageSubmissionResult" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetOfferList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetOfferList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetOfferListPaginated"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetOfferListPaginated" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetSellerInformation"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetSellerInformation" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetSellerIndicators"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetSellerIndicators" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetOrderList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetOrderList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetServiceOrderList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetServiceOrderList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ValidateOrderList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/ValidateOrderList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ManageParcel"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/ManageParcel" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CreateRefundVoucherAfterShipment"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/CreateRefundVoucherAfterShipment" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CreateRefundVoucher"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/CreateRefundVoucher" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetGlobalConfiguration"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetGlobalConfiguration" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GenerateDiscussionMailGuid"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GenerateDiscussionMailGuid" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubmitRelaysFile"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/SubmitRelaysFile" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetRelaysFileSubmissionResult"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetRelaysFileSubmissionResult" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetParcelShopList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetParcelShopList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CloseDiscussionList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/CloseDiscussionList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetOrderClaimList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetOrderClaimList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetOrderQuestionList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetOrderQuestionList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetOfferQuestionList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetOfferQuestionList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetDiscussionMailList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetDiscussionMailList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CreateExternalOrder"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/CreateExternalOrder" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetExternalOrderStatus"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetExternalOrderStatus" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetProductStockList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetProductStockList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetFulfilmentActivationReportList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetFulfilmentActivationReportList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetFulfilmentOrderListToSupply"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetFulfilmentOrderListToSupply" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubmitFulfilmentSupplyOrder"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/SubmitFulfilmentSupplyOrder" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubmitFulfilmentOnDemandSupplyOrder"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/SubmitFulfilmentOnDemandSupplyOrder" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetFulfilmentDeliveryDocument"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetFulfilmentDeliveryDocument" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubmitOfferStateAction"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/SubmitOfferStateAction" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetFulfilmentSupplyOrder"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetFulfilmentSupplyOrder" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SubmitFulfilmentActivation"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/SubmitFulfilmentActivation" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetFulfilmentSupplyOrderReportList"><soap:operation soapAction="http://www.cdiscount.com/IMarketplaceAPIService/GetFulfilmentSupplyOrderReportList" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="MarketplaceAPIService"><wsdl:port name="BasicHttpBinding_IMarketplaceAPIService" binding="tns:BasicHttpBinding_IMarketplaceAPIService"><soap:address location="https://wsvc.cdiscount.com/MarketplaceAPIService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>